src/modalDisplacementPointPatchVectorField/testCases/cylinder2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/setup.OpenFOAM"

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          1e-4;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

// For free surface mostly.
adjustTimeStep  no;
maxCo           0.5;
maxAlphaCo      0.5;

libs            ("libmodalDisplacementPointPatchField.so");

functions
{
//    #include "include/functionObjectFieldAverageI";
//    #include "include/functionObjectProbesI";
//    #include "include/functionObjectForceCoeffsI";
    #include "include/functionObjectForcesI";
//    #include "include/functionObjectSlicePlaneI";
//    #include "include/functionObjectIsoSurfaceI";
};

// ************************************************************************* //
