src/modalDisplacementPointPatchVectorField/testCases/cylinder2D/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
|==========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.0.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
	( -1.000000 -0.050000 -1.000000 )
	( 5.000000 -0.050000 -1.000000 )
	( 5.000000 0.050000 -1.000000 )
	( -1.000000 0.050000 -1.000000 )
	( -1.000000 -0.050000 1.000000 )
	( 5.000000 -0.050000 1.000000 )
	( 5.000000 0.050000 1.000000 )
	( -1.000000 0.050000 1.000000 )

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 2 40) simpleGrading (1 1 1)
);

edges ();
boundary
(
    front
    {
        type empty;
        faces
        (
            (3 7 6 2)
        );
    }
    back
    {
        type empty;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    slipWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs ();

