src/modalDisplacementPointPatchVectorField/testCases/cylinder2D/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      autoHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;


geometry
{
    box
    {
        type searchableBox;
        min (-0.1 -1 -0.2);
        max (0.5 1 0.2);
    }

    cylinderWall.stl
    {
        type triSurfaceMesh;
        regions
        {
            cylinderWall
            {
                name cylinderWall;
            }
        }
    }

};



castellatedMeshControls
{
    maxLocalCells 3000000;

    maxGlobalCells 20000000;

    minRefinementCells 0;

    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 4;

    features
    (
    /*
        {
            file "cylinderWall.eMesh";
            level 2;
            // Example levels ((0 2) (0.3 1));
        }
        */
    );

    refinementSurfaces
    {
        /* example try to create zones
        heater
        {
            level (1 1);
            faceZone heater;
            cellZone heater;
            cellZoneInside inside;
        }

        example.stl
        {
            level (2 2);
            regions
            {
                secondSolid {level (3 4);}
            }
            patchInfo
            {
                type wall;
                inGroups (wallGroup);
            }
        }
        cylinder.stl
        {
            level (2 2);
            faceZone            MRF;
            cellZone            MRF;
            cellZoneInside      inside;
            faceType            internal; //baffle,boundary
        }
        */

        cylinderWall.stl
        {
            level (0 0);
            regions
            {
                cylinderWall
                {
                    level (4 4);
                    patchInfo
                    {
                        type wall;
                        inGroups (wallGroup);
                    }
                }
            }
        }


    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        box
        {
            mode inside;
            levels ((1.0 3));
        }

        /*
        sphere.stl
        {
            mode distance;
            levels ((1.0 5) (2.0 3));
        }
        */
    }

    locationInMesh ( 0.1 0 0 );

    allowFreeStandingZoneFaces true;
}



snapControls
{
    nSmoothPatch 3;

    tolerance 2.0;

    nSolveIter 30;

    nRelaxIter 5;

    nFeatureSnapIter 10;

    implicitFeatureSnap false;

    explicitFeatureSnap true;

    multiRegionFeatureSnap false;
}



addLayersControls
{
    relativeSizes true;

    // Layer thickness specification. This can be specified in one of four ways
    // - expansionRatio and finalLayerThickness (cell nearest internal mesh)
    // - expansionRatio and firstLayerThickness (cell on surface)
    // - overall thickness and firstLayerThickness
    // - overall thickness and finalLayerThickness

    expansionRatio 1.2;
    finalLayerThickness 0.5;
        //firstLayerThickness 0.1;

    minThickness 0.1;

    layers
    {
        wallGroup
        {
            nSurfaceLayers 3;
            firstLayerThickness 0.1;
            thickness 0.5;
        }
    }


    nGrow 1;

    // Advanced settings

    featureAngle 60;

    slipFeatureAngle 30;

    nRelaxIter 5;

    nSmoothSurfaceNormals 1;

    nSmoothNormals 3;

    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;

    maxThicknessToMedialRatio 0.3;

    minMedianAxisAngle 150; //90;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;

    nRelaxedIter 20;
}



meshQualityControls
{
    maxNonOrtho 70;

    maxBoundarySkewness 20;

    maxInternalSkewness 4;

    maxConcave 80;

    minVol 1e-30;

    minTetQuality -1e30; //1e-9;

    minArea -1;

    minTwist 0.05;

    minDeterminant 0.001;

    minFaceWeight 0.05;

    minVolRatio 0.01;

    minTriangleTwist -1;

    // Advanced

    nSmoothScale 4;

    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 80;
    }

}


// Advanced

debug 0;

mergeTolerance 1E-6;


// ************************************************************************* //
