src/modalDisplacementPointPatchVectorField/testCases/cylinder2D/constant/structuralModes/modeData_cylinderWall
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      structuralModes_rod_wall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    a
    {
        uniformMode true;
        generatedMode
        {
            amplitude (1 0 0);
        }
        frequency   24.5;
        scalingFactor 1;
        modeDisplacement 0();
    }

    b
    {
        uniformMode true;
        generatedMode
        {
            amplitude (0 0 1);
        }
        frequency   24.5;
        scalingFactor 1;
        modeDisplacement 0();
    }


);

// ************************************************************************* //
