src/modalDisplacementPointPatchVectorField/testCases/cylinder2D/0/include/general.in
    slipGroup
    {
        type        slip;
    }
