src/modalDisplacementPointPatchVectorField/testCases/cylinder2D/0/nuSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/boundaryConditions/basic";

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
#   include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes";

    defaultGroup { $:bc.default.nuSgs }

    inletGroup { $:bc.fixedInlet.nuSgs; }

    wallGroup { $:bc.walls.nuSgs; }

    slipGroup       { $:bc.slipWalls.nuSgs; }

    movingWallGroup { $:bc.walls.nuSgs; }

    ambienceGroup { $:bc.totalPressure.nuSgs; }

    outflowGroup { $:bc.pressureOutlet.nuSgs; }

    farfieldGroup { $:bc.freestream.nuSgs; }

#   include "include/general.in";
}

// ************************************************************************* //
