src/modalDisplacementPointPatchVectorField/testCases/cylinder2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/boundaryConditions/basic";

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
#   include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes";

    defaultGroup { $:bc.default.nut }

    inletGroup { $:bc.fixedInlet.nut; }

    wallGroup { $:bc.walls.nut; }

    slipGroup       { $:bc.slipWalls.nut; }

    movingWallGroup { $:bc.walls.nut; }

    ambienceGroup { $:bc.totalPressure.nut; }

    outflowGroup { $:bc.pressureOutlet.nut; }

    farfieldGroup { $:bc.freestream.nut; }

#   include "include/general.in";
}

// ************************************************************************* //
