src/modalDisplacementPointPatchVectorField/testCases/cylinder2D/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* Example porous zone
porosity1
{
    type            explicitPorositySource;
    active          true;
    selectionMode   cellZone;
    cellZone        porosity;

    explicitPorositySourceCoeffs
    {
        type            fixedCoeff;
        active          yes;
        cellZone        porosity;

        fixedCoeffCoeffs
        {
            alpha       alpha [0 0 -1 0 0 0 0] (500 -1000 -1000);
            beta        beta  [0 -1 0 0 0 0 0] (0 0 0);
            rhoRef      1;

            coordinateSystem
            {
                e1  (0.70710678 0.70710678 0);
                e2  (0 0 1);
            }
        }
    }
}
*/

/* Example MRF zone
MRF1
{
    type            MRFSource;
    active          true;
    selectionMode   cellZone;
    cellZone        rotor;

    MRFSourceCoeffs
    {
        origin      (0 0 0);
        axis        (0 0 1);
        omega       104.72;
    }
}
*/

/* For compressible flow */
/*
fixedTemperaure1
{
    type            fixedTemperatureConstraint;
    active          true;
    selectionMode   cellZone;
    cellZone        porosity;

    fixedTemperatureConstraintCoeffs
    {
        mode            uniform;
        temperature     350;
    }
}
*/




// ************************************************************************* //
