src/modalDisplacementPointPatchVectorField/testCases/cylinder2D/system/include/functionObjectForcesI
    forces
    {
        type                forces;
        functionObjectLibs  ("libforces.so");
        outputControl       timeStep;
        outputInterval      10;
        patches             ("cylinder.*");
        pName               p;
        UName               U;
        rhoName             rhoInf;
        log                 true;
        rhoInf              1;
        CofR                (0 0 0);
    }
