src/modalDisplacementPointPatchVectorField/testCases/cylinder2D/system/include/functionObjectSlicePlaneI
cuttingPlane
{
    type            surfaces;
    functionObjectLibs ("libsampling.so");
    outputControl   timeStep;
    outputInterval  100;

    surfaceFormat   vtk;
    fields          ( p U );

    interpolationScheme cellPoint;

    surfaces
    (
        yNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                basePoint       (0 0 0);
                normalVector    (0 1 0);
            }
            interpolate     false;
        }
    );
}

